src/DataProcessors/РабочийКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>РабочийКалендарь</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/Профосмотры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Профосмотры</Name>
			<Comment>Хранит историю проведения и планирования профосмотров</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапланированная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПрофосмотров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНаправления</Name>
					<Comment>Причина направления к врачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПереноса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОсмотров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИнтервалыЛистаОжидания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИнтервалыЛистаОжидания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДняСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодыДня</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ВремяРаботыСотрудниковПлан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВремяРаботыСотрудниковПлан</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Минуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцОтбор</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ДоступныеПериодыОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДоступныеПериодыОтчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыСобытия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПодтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПациентОжидает</Name>
					<Comment>Для предварительной записи более не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНачат</Name>
					<Comment>Пациент в кресле</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОкончен</Name>
					<Comment>Прием окончен</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНеСостоялся</Name>
					<Comment>Для предварительной записи более не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОтменен</Name>
					<Comment>Прием отменен</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ПартииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПартииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСерии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Помещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Помещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтображатьВРасписанииЗанятий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Comment>Цвет фона помещения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/РабочийКалендарь/Forms/ФормаПредварительнойЗаписи/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Параметры.Свойство("Сотрудник"					      , ОтборСотрудник);
	Параметры.Свойство("Контрагент"					      , ОтборКонтрагент);
	Параметры.Свойство("ЗакрытьПриСозданииЗаписи"	      , ПФЗакрытьПриСозданииЗаписи);
	Параметры.Свойство("ИмяКонтрагента"				      , ИмяКонтрагента);
	Параметры.Свойство("ТелефонКонтрагента"			      , ТелефонКонтрагента);
	Параметры.Свойство("Дата"                    	      , Объект.Дата); 
	Параметры.Свойство("ПеренесённаяПредварительнаяЗапись", ПеренесённаяПредварительнаяЗапись); 
	Параметры.Свойство("СтруктурнаяЕдиница"				  , Объект.СтруктурнаяЕдиница);
	
	Если НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		Объект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	ПЗГрафикаРежимОтображения = 1;
	Если Параметры.Свойство("ПереключательПериода")
		И ЗначениеЗаполнено(Параметры.ПереключательПериода) Тогда
		
		ПЗГрафикаРежимОтображения = ?(Параметры.ПереключательПериода = Перечисления.ДоступныеПериодыОтчета.День, 0, 1);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтборСотрудник) И Параметры.Свойство("СпециализацияВрача") Тогда
		СпециализацияВрача = Параметры.СпециализацияВрача;
		Элементы.ОтборСотрудник.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	КонецЕсли;	
	
	БуферОбмена = Новый Структура("Буфер, ПризнакВырезать");
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ?(ЗначениеЗаполнено(Константы.ДатаДемоРежима.Получить()), Константы.ДатаДемоРежима.Получить(), ТекущаяДата());
	КонецЕсли;	
	ДобавитьДинамическиЛегендыПоКатегорям();
	
	ПолучитьРазрешениеМонитораКлиента();
	
	ЭтотОбъект.ЦветаЭлементов = Новый Структура;
	
	ЦветаЭлементов.Вставить("ЦветФона"                   , Новый Цвет(255, 255, 255));
	ЦветаЭлементов.Вставить("ЦветФонаВыбранного"         , Новый Цвет(218, 230, 244));
	ЦветаЭлементов.Вставить("ЦветТекста"                 , Новый Цвет(51,  102, 187));
	ЦветаЭлементов.Вставить("ЦветТекстаВыбранного"       , Новый Цвет(64,  64,  64));
	ЦветаЭлементов.Вставить("ЦветТекстаНеактивногоВизита", Новый Цвет(128, 128, 128));
	ЦветаЭлементов.Вставить("ЦветРамкиАктивногоВизита"   , WebЦвета.Красный);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриОткрытии формы.
//
Процедура ПриОткрытии(Отказ)
	
	РазрешениеЭкрана = ОбщегоНазначенияКлиентСерверСтоматология.ОпределитьТекущееРазрешениеЭкрана();
	
	// Устанавливаем необходимые свойства
	ТабличныйДокумент.ФиксацияСверху = 1;
	ТабличныйДокумент.ФиксацияСлева = 2;
	ОтображениеГрафика = ?(ЗначениеЗаполнено(СпециализацияВрача) ИЛИ ЭтотОбъект.ПЗГрафикаРежимОтображения = 0, Элементы.День, Элементы.Неделя);
	
	УстановитьСтраницуМенеджера(ОтображениеГрафика); 
	
	ОбновитьГрафик(,Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик оповещения формы.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененоСобытие" Тогда
		ОбновитьГрафик(Ложь);
		ЭтотОбъект.СотрудникПриКонтролеЗаписиПациента = Неопределено;
	ИначеЕсли ИмяСобытия = "ИзмененаСтруктурнаяЕдиница" Тогда
		Объект.СтруктурнаяЕдиница = Параметр.ТекущаяСтруктурнаяЕдиница;
		ОбновитьГрафик(); 
	ИначеЕсли ИмяСобытия = "ОбновлениеРабочегоСтола" Тогда		
		ОбновитьГрафик(Ложь);	
	ИначеЕсли ИмяСобытия = "СозданиеСобытияСКонтрагентом" Тогда
		
		Если Параметр.Свойство("Контрагент") Тогда
			ЭтотОбъект.ОтборКонтрагент = Параметр.Контрагент;
		КонецЕсли;
		
		Если Параметр.Свойство("КонтролироватьЗаписьПациентаПоСотруднику")
			И Параметр.КонтролироватьЗаписьПациентаПоСотруднику = Истина Тогда
			
			Параметр.Свойство("СотрудникПриКонтролеЗаписиПациента", ЭтотОбъект.СотрудникПриКонтролеЗаписиПациента);
		Иначе
			ЭтотОбъект.СотрудникПриКонтролеЗаписиПациента = Неопределено;		
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Обработчик 
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ПФЗакрытьПриСозданииЗаписи Тогда
		ОповеститьОЗаписиНового(НовыйОбъект);
		Закрыть(НовыйОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура заполняет табличный документ.
//
Процедура ОбновитьГрафик(РазрешитьСмещениеГрафика = Истина,ОбновитьПанельДни = Ложь)
	
	ВыбранныеСотрудники = Новый Массив;
	// ВыбранныеСотрудники.Добавить("Все");
	Если ЗначениеЗаполнено(СпециализацияВрача) Тогда
		МассивСотрудников = ПолучитьМассивВрачейПоСпециализации(СпециализацияВрача); 
		Если ЗначениеЗаполнено(МассивСотрудников) Тогда
			Для Каждого Сотрудник Из МассивСотрудников Цикл
				ВыбранныеСотрудники.Добавить(Сотрудник); 	
			КонецЦикла;
		Иначе 
			ВыбранныеСотрудники.Добавить("Все");
		КонецЕсли;
	Иначе
		ВыбранныеСотрудники.Добавить(?(Не ОтборСотрудник.Пустая(), ОтборСотрудник, "Все")); 
	КонецЕсли;
	ВыбранныеПомещения = Новый Массив; 
	ВыбранныеПомещения.Добавить("Все");
	
	// Создаем структуру с параметрами построения графика
	ПараметрыПостроения = Новый Структура("ВыбранныеСотрудники, ВыбранныеПомещения, ВыбранныеКонтрагенты, СтраницаМенеджера, РазрешениеЭкрана, СтруктурнаяЕдиница, Дата, РазрешитьСмещениеГрафика,НаВсюФорму");
	ПараметрыПостроения.ВыбранныеСотрудники			=	ВыбранныеСотрудники;
	ПараметрыПостроения.ВыбранныеПомещения			=	ВыбранныеПомещения;
	ПараметрыПостроения.ВыбранныеКонтрагенты		=	Неопределено;
	ПараметрыПостроения.СтраницаМенеджера			=	ПолучитьСтраницуМенеджера();
	ПараметрыПостроения.СтруктурнаяЕдиница			=	Объект.СтруктурнаяЕдиница;
	ПараметрыПостроения.Дата						=	Объект.Дата;
	ПараметрыПостроения.РазрешитьСмещениеГрафика	=   РазрешитьСмещениеГрафика;
	ПараметрыПостроения.РазрешениеЭкрана			=   РазрешениеЭкрана;
	ПараметрыПостроения.НаВсюФорму			        =   Истина;
	#Если Не ВебКлиент Тогда
		ПараметрыПостроения.Вставить("ВыводитьКартинки", Истина);
	#КонецЕсли
	
	РабочийКалендарьСформироватьГрафикСобытий(ПараметрыПостроения,РазрешитьСмещениеГрафика,ОбновитьПанельДни);
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет формирование графика событий.
//  Параметры: 
//   ПараметрыПостроения - структура, содержит параметры, по которым выполняется формирование графика.
//
Процедура РабочийКалендарьСформироватьГрафикСобытий(ПараметрыПостроения, РазрешитьСмещениеГрафика = Истина,ОбновитьПанельДни = Ложь)	
	
	Если ОбновитьПанельДни Тогда
		ОбновитьПанельДниНеделиСервер();
	КонецЕсли;
	
	ЭтотОбъект.СписокСотрудниковВЛистеОжидания.Очистить();
	ПараметрыПостроения.Вставить("СписокСотрудниковВЛистеОжидания", ЭтотОбъект.СписокСотрудниковВЛистеОжидания);
	
	// Вызываем процедуру построения графика
	ГрафикСобытий = ОбщегоНазначенияСтоматология.СформироватьГрафикСобытий(ПараметрыПостроения);
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.ВставитьОбласть(ГрафикСобытий.Область());	
	// Устанавливаем необходимые свойства
	НеобходимаяГоризонтальнаяПрокрутка = ?(ПараметрыПостроения.Свойство("ОграничениеНаШиринуДня"), Истина, Ложь);
	Если Элементы.ТабличныйДокумент.ГоризонтальнаяПолосаПрокрутки <> НеобходимаяГоризонтальнаяПрокрутка Тогда
		Элементы.ТабличныйДокумент.ГоризонтальнаяПолосаПрокрутки = НеобходимаяГоризонтальнаяПрокрутка;
	КонецЕсли;	
	// ИнтервалГрафикаЗанятий = Пользователи.ПолучитьЗначениеПоУмолчаниюПользователя(, "ИнтервалГрафикаЗанятий");
	ИнтервалГрафикаЗанятий = 15; //?(ЗначениеЗаполнено(ИнтервалГрафикаЗанятий), Число(Сред(ИнтервалГрафикаЗанятий, 1, 2)), 15);	
	
	ТабличныйДокумент.ФиксацияСверху = ?(НЕ ГрафикСобытий.ФиксацияСверху = 0, ГрафикСобытий.ФиксацияСверху, 1);
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события ПриИзменении поля ввода Дата
//
Процедура ОбновитьПанельДниНеделиСервер() 
	
	Если Элементы.Неделя.Пометка Тогда
		КонецМесяца = КонецМесяца(Объект.Дата);
		НомерВсегоНедель = Цел((День(КонецМесяца) - ДеньНедели(КонецМесяца)) / 7) + ?((День(КонецМесяца) - ДеньНедели(КонецМесяца)) % 7 > 0, 1, 0) + 1;
		Элементы.ДатаНеделяМесяца1.Пометка = Ложь;
		Элементы.ДатаНеделяМесяца2.Пометка = Ложь;
		Элементы.ДатаНеделяМесяца3.Пометка = Ложь;
		Элементы.ДатаНеделяМесяца4.Пометка = Ложь;
		Элементы.ДатаНеделяМесяца5.Пометка = Ложь;
		Элементы.ДатаНеделяМесяца6.Пометка = Ложь;
		Элементы.ДатаНеделяМесяца1.Заголовок = ВернутьЗаголовокНеделиМесяца(Объект.Дата, 1);
		Элементы.ДатаНеделяМесяца2.Заголовок = ВернутьЗаголовокНеделиМесяца(Объект.Дата, 2);
		Элементы.ДатаНеделяМесяца3.Заголовок = ВернутьЗаголовокНеделиМесяца(Объект.Дата, 3);
		Элементы.ДатаНеделяМесяца4.Заголовок = ВернутьЗаголовокНеделиМесяца(Объект.Дата, 4);
		Элементы.ДатаНеделяМесяца5.Заголовок = ВернутьЗаголовокНеделиМесяца(Объект.Дата, 5);
		Элементы.ДатаНеделяМесяца6.Заголовок = ВернутьЗаголовокНеделиМесяца(Объект.Дата, 6);
		Элементы["ДатаНеделяМесяца" + ВернутьНомерНеделиМесяца(Объект.Дата)].Пометка = Истина;
		Для а = 1 По 6 Цикл
			Элементы["ДатаНеделяМесяца" + а + ""].Видимость = ?(а <= НомерВсегоНедель, Истина, Ложь);
		КонецЦикла;
	Иначе
	    Элементы.ДатаДеньНедели1.Пометка = Ложь;
		Элементы.ДатаДеньНедели2.Пометка = Ложь;
		Элементы.ДатаДеньНедели3.Пометка = Ложь;
		Элементы.ДатаДеньНедели4.Пометка = Ложь;
		Элементы.ДатаДеньНедели5.Пометка = Ложь;
		Элементы.ДатаДеньНедели6.Пометка = Ложь;
		Элементы.ДатаДеньНедели7.Пометка = Ложь;		
		Элементы.ДатаДеньНедели1.Заголовок = ВернутьЗаголовокДняНедели(Объект.Дата, 1);
		Элементы.ДатаДеньНедели2.Заголовок = ВернутьЗаголовокДняНедели(Объект.Дата, 2);
		Элементы.ДатаДеньНедели3.Заголовок = ВернутьЗаголовокДняНедели(Объект.Дата, 3);
		Элементы.ДатаДеньНедели4.Заголовок = ВернутьЗаголовокДняНедели(Объект.Дата, 4);
		Элементы.ДатаДеньНедели5.Заголовок = ВернутьЗаголовокДняНедели(Объект.Дата, 5);
		Элементы.ДатаДеньНедели6.Заголовок = ВернутьЗаголовокДняНедели(Объект.Дата, 6);
		Элементы.ДатаДеньНедели7.Заголовок = ВернутьЗаголовокДняНедели(Объект.Дата, 7);
		Элементы["ДатаДеньНедели" + ДеньНедели(Объект.Дата)].Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДинамическиЛегендыПоКатегорям()
	
	// ВыборкаМеток = Справочники.Метки.Выбрать();
	// Пока ВыборкаМеток.Следующий() Цикл
	//	Если Не ВыборкаМеток.ЭтоГруппа Тогда 
	//		Элемент = Элементы.Добавить("КнопкаМетка_" + ВыборкаМеток.Код, Тип("КнопкаФормы"), Элементы.ГруппаЛегендыЦветовСобытий);
	//		Элемент.ЦветФона = ?(ЗначениеЗаполнено(ВыборкаМеток.ЦветМетки), ЗначениеИзСтрокиВнутр(ВыборкаМеток.ЦветМетки), Новый Цвет());
	//		Элемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	//		Элемент.ИмяКоманды = "ЛегендаИзменениеЦвета";
	//		Элемент.Отображение = ОтображениеКнопки.Картинка;
	//		Элемент.Ширина = 3;
	//		Элемент = Элементы.Добавить("НадписьМетка_" + ВыборкаМеток.Код, Тип("ДекорацияФормы"), Элементы.ГруппаЛегендыЦветовСобытий);
	//		Элемент.Вид = ВидДекорацииФормы.Надпись;
	//		Элемент.Заголовок = "-  " + ВыборкаМеток.Наименование;
	//	КонецЕсли;
	// КонецЦикла;
	
	ЗаголовокУстановлен = Ложь;
	Индекс = 0;
	Для Каждого СтатусСобытия Из Перечисления.СтатусыСобытия Цикл
		Если СтатусСобытия <> Перечисления.СтатусыСобытия.ПриемОтменен Тогда
			Если НЕ ЗаголовокУстановлен Тогда
				Элемент = Элементы.Добавить("НадписьМетка_Заголовок_Статусы", Тип("ДекорацияФормы"), Элементы.ГруппаЛегендыЦветовСобытий);
				Элемент.Вид = ВидДекорацииФормы.Надпись;
				Элемент.Заголовок = "Статусы:";
				ЗаголовокУстановлен = Истина;
			КонецЕсли;
			Элемент = Элементы.Добавить("КнопкаСтатус_" + Индекс, Тип("КнопкаФормы"), Элементы.ГруппаЛегендыЦветовСобытий);
			Элемент.ЦветФона = ОбщегоНазначенияСтоматология.ПолучитьЦветФонаСобытия(СтатусСобытия);
			Элемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			Элемент.ИмяКоманды = "ЛегендаИзменениеЦвета";
			Элемент.Отображение = ОтображениеКнопки.Картинка;
			Элемент.Ширина = 3;
			Элемент = Элементы.Добавить("НадписьСтатус_" + Индекс, Тип("ДекорацияФормы"), Элементы.ГруппаЛегендыЦветовСобытий);
			Элемент.Вид = ВидДекорацииФормы.Надпись;
			Элемент.Заголовок = "" + Строка(СтатусСобытия);
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте 
Функция ПолучитьСтраницуМенеджера() 
	
	СтраницаМенеджера = "";	
	Если Элементы.Неделя.Пометка Тогда
		СтраницаМенеджера = "Неделя";
	ИначеЕсли Элементы.День.Пометка Тогда
		СтраницаМенеджера = "Сотрудники";
	КонецЕсли;	
	Возврат СтраницаМенеджера;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - КОМАНДЫ КНОПОК

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура изменяет пометку кнопки День.
//
Процедура КомандаДень(Команда)	
	ПЗГрафикаРежимОтображения = 0;
	ПЗФильтрГрафикаОбновить   = Истина;
	// ОбновлениеСтраницыЖурналПредварительнойЗаписи(,Истина);

    УстановитьСтраницуМенеджера(Элементы.День);	
	ОбновитьГрафик(,Истина);	
КонецПроцедуры

&НаКлиенте
// Процедура изменяет пометку кнопки Неделя.
//
Процедура КомандаНеделя(Команда)
	ПЗГрафикаРежимОтображения = 1;
	УстановитьСтраницуМенеджера(Элементы.Неделя);	
	ОбновитьГрафик(,Истина);	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить страницу менеджера.
//
Процедура УстановитьСтраницуМенеджера(ЭлементГруппировки)	
	Элементы.День.Пометка 			= Ложь;
	Элементы.Неделя.Пометка 		= Ложь;	
	ЭлементГруппировки.Пометка		= Истина;
	Если ЭлементГруппировки = Элементы.Неделя Тогда
		Элементы.ГруппаКоманднаяПанельДни.Видимость 	= Ложь;
		Элементы.ГруппаКоманднаяПанельНедели.Видимость  = Истина;
	Иначе
		Элементы.ГруппаКоманднаяПанельДни.Видимость 	= Истина;
		Элементы.ГруппаКоманднаяПанельНедели.Видимость  = Ложь;		
	КонецЕсли;	
	
	УстановитьЦветГруппыКнопки();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////
///// ОБРАБОТЧИКИ КОМАНДНОЙ ПАНЕЛИ ТАБЛИЦЫ ЗАДАЧ

&НаКлиенте
Процедура ПерейтиНеделяПредыдущая(Команда)	
	Объект.Дата = Объект.Дата - 7 * 24 * 60 * 60;
	ОбновитьГрафик(,Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНеделяСледующая(Команда)	
	Объект.Дата = Объект.Дата + 7 * 24 * 60 * 60;
	ОбновитьГрафик(,Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПредыдущийМесяц(Команда)	
	Объект.Дата = ДобавитьМесяц(Объект.Дата, -1);
	ОбновитьГрафик(,Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиСледующийМесяц(Команда)
	Объект.Дата = ДобавитьМесяц(Объект.Дата, 1);
	ОбновитьГрафик(,Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиДеньНедели(Команда)
	Объект.Дата = НачалоНедели(Объект.Дата) + Число(Сред(Команда.Имя, СтрДлина(Команда.Имя), 1) - 1) * 24 * 60 * 60;
    ОбновитьГрафик(,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНеделяМесяца(Команда)
	НеобходимаяДата = НачалоМесяца(Объект.Дата) + Число(Сред(Команда.Имя, СтрДлина(Команда.Имя), 1) - 1) * 7 * 24 * 60 * 60;
	Если Месяц(Объект.Дата) = Месяц(НеобходимаяДата) Тогда
		Объект.Дата = НачалоМесяца(Объект.Дата) + Число(Сред(Команда.Имя, СтрДлина(Команда.Имя), 1) - 1) * 7 * 24 * 60 * 60;
	Иначе
		Объект.Дата = КонецМесяца(Объект.Дата);
	КонецЕсли;
	ОбновитьГрафик(,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДиалогКалендаря(Команда)

	ОткрытьФорму("Справочник.ПартииНоменклатуры.ФормаВыбора", Новый Структура("Дата", Объект.Дата),,,,, Новый ОписаниеОповещения("ДиалогКалендаряВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		
	
КонецПроцедуры

#КонецОбласти



&НаКлиенте                 
Процедура ДиалогКалендаряВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.Дата = Результат;
		ОбновитьГрафик(,Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Процедура - обработчик события ПриИзменении поля ввода Дата
//
Функция ВернутьЗаголовокДняНедели(Знач Дата, НомерДня)	
       	СтруктураСокрашенияМесяца = Новый Структура("М1, М2, М3, М4, М5, М6, М7, М8, М9, М10, М11, М12", "Янв.", "Фев.", "Март", "Апр.", "Май", "Июнь", "Июль", "Авг.", "Сен.", "Окт.", "Нояб.", "Дек.");
	Дата                      = НачалоНедели(Дата) + (НомерДня - 1) * 24 * 60 * 60;	
	Возврат " " + Формат(Дата, "ДФ=dd") + " " + СтруктураСокрашенияМесяца["М" + Месяц(Дата)];	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Процедура - обработчик события ПриИзменении поля ввода Дата
//
Функция ВернутьЗаголовокНеделиМесяца(Знач Дата, НомерНедели)	
	Дата                 = НачалоМесяца(Дата);
	НачалоНеделиПоНомеру = НачалоНедели(Дата + (НомерНедели - 1) * 7 * 24 * 60 * 60);
	КонецНеделиПоНомеру  = КонецНедели(Дата + (НомерНедели - 1) * 7 * 24 * 60 * 60);	
	Возврат " " + Формат(НачалоНеделиПоНомеру, "ДФ=dd") + " - " + Формат(КонецНеделиПоНомеру, "ДФ=dd")+" " +Формат(КонецНеделиПоНомеру, "ДФ=MMM");	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Процедура - обработчик события ПриИзменении поля ввода Дата
//
Функция ВернутьНомерНеделиМесяца(Знач Дата)	
	НомерНедели = Цел((День(Дата) + ДеньНедели(НачалоМесяца(Дата) ) - 2 ) / 7) + 1;	
	Возврат НомерНедели;	
КонецФункции

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)	
	ОбновитьГрафик();	
КонецПроцедуры

///////////////////////////////// ОБРАБОТЧИКИК ТАБЛИЦЫ ГРАФИКА ПЗ ////////////////////////////////////////

&НаКлиенте
// Обработчик активации строки табличного документа
//
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)	
	
	Расшифровка                 = Элементы.ТабличныйДокумент.ТекущаяОбласть.Расшифровка;
	ПЗРасшифровкаТекущейОбласти = Неопределено;
	Если Не Расшифровка = Неопределено И ТипЗнч(Расшифровка) = Тип("Строка") Тогда				
    	ПЗРасшифровкаТекущейОбласти = КонвертироватьРасшифровкуТабличногоДокумента(Расшифровка,ПолучитьСтраницуМенеджера());					
	КонецЕсли;	  
	
КонецПроцедуры

&НаКлиенте
// Функция конвертирования строки расшифровки графика ПЗ в структуру данных
Функция КонвертироватьРасшифровкуТабличногоДокумента(Расшифровка,СтраницаМенеджера)  
	
	ШаблонТипов = Новый Структура;
	ШаблонТипов.Вставить("Дата"        ,Тип("Дата"));
	ШаблонТипов.Вставить("Интервал"    ,Тип("Число"));
	Если СтраницаМенеджера = "Сотрудники" Тогда
		ШаблонТипов.Вставить("Сотрудник"   ,Тип("СправочникСсылка.Сотрудники"));
	ИначеЕсли СтраницаМенеджера = "Помещения" Тогда
		ШаблонТипов.Вставить("Сотрудник"   ,Тип("СправочникСсылка.Помещения"));
	Иначе
		ШаблонТипов.Вставить("Сотрудник"   ,Тип("Строка"));
	КонецЕсли;
	ШаблонТипов.Вставить("РабочееВремя",Тип("Булево"));
	ШаблонТипов.Вставить("Событие"     ,Тип("ДокументСсылка.Событие"));
	ШаблонТипов.Вставить("ИндексВТЧ"   ,Тип("Массив"));
	
	ШаблонТипов.Вставить("Заглушка1"   ,Неопределено);
	ШаблонТипов.Вставить("Заглушка2"   ,Неопределено);
	ШаблонТипов.Вставить("КоличествоВЛистеОжидания" ,Тип("Число"));
	Возврат ОбщегоНазначенияСтоматология.ПривестиСтрокуВНаборДанных(Расшифровка,ШаблонТипов);
	
КонецФункции

&НаКлиенте
// Обработчик события ОбработкаРасшифровки элемента ТабличныйДокумент.
//
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)	
	
	СтандартнаяОбработка = Ложь;
	СтруктураДанных      = ПЗРасшифровкаТекущейОбласти;
	Если ТипЗнч(Расшифровка) = Тип("Строка") Тогда		
		// СтруктураДанных = КонвертироватьРасшифровкуТабличногоДокумента(Расшифровка,ПолучитьСтраницуМенеджера());
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("Дата") Тогда			
		Объект.Дата               = Расшифровка;		
		ОбновитьГрафик(,Истина);			
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Сотрудники") Тогда 		
		ОткрытьФорму("Справочник.Должности.ФормаОбъекта", Новый Структура("Ключ",ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Расшифровка, "Должность")));	
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Помещения") Тогда 		
		ОткрытьФорму("Справочник.Помещения.ФормаОбъекта", Новый Структура("Ключ",Расшифровка));		
	КонецЕсли;	
	// Если удалось успешно конвертировать строку данных
	Если НЕ СтруктураДанных = Неопределено Тогда
		
		Если СтруктураДанных.Свойство("КоличествоВЛистеОжидания") И НЕ СтруктураДанных.КоличествоВЛистеОжидания = Неопределено
			И ЗначениеЗаполнено(СтруктураДанных.Сотрудник) Тогда
			
			Если ЗначениеЗаполнено(СтруктураДанных.КоличествоВЛистеОжидания) Тогда
				ОткрытьЛистОжиданияПациентов(СтруктураДанных.Сотрудник, СтруктураДанных.Дата);
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанных.Событие) Тогда		
			СтандартнаяОбработка = Ложь;
			ОткрытьФорму("Документ.Событие.ФормаОбъекта", Новый Структура("Ключ", СтруктураДанных.Событие));		
		ИначеЕсли НЕ ЗначениеЗаполнено(СтруктураДанных.Событие)Тогда		
			СтандартнаяОбработка = Ложь;
			СоздатьСобытие(Неопределено);				
	    КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Обработчик дополнительной расшифровки табличного документа 
//
Процедура ТабличныйДокументОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	// Установка состояний кнопкам контекстного меню
	Если Не ПЗРасшифровкаТекущейОбласти = Неопределено Тогда
		// Устанавливаем доступность всем в Ложь
		СтруктураСостояния = Новый Структура;
		СтруктураСостояния.Вставить("ТабличныйДокументКонтекстноеМенюСоздатьСобытие"			,Ложь);
		СтруктураСостояния.Вставить("ТабличныйДокументКонтекстноеМенюОтменитьСобытие"			,Ложь);
		СтруктураСостояния.Вставить("ТабличныйДокументКонтекстноеМенюПравкаВырезать"			,Ложь);
		СтруктураСостояния.Вставить("ТабличныйДокументКонтекстноеМенюПравкаКопировать"			,Ложь);
		СтруктураСостояния.Вставить("ТабличныйДокументКонтекстноеМенюПравкаВставить"			,Ложь);
		СтруктураСостояния.Вставить("ТабличныйДокументКонтекстноеМенюЗаписатьИзЛистаОжидания"	,Ложь);
		// В зависимости от рассшифровки, устанавливаем видимость в Истинну для определенных элементов меню
		// Для области занятой существующим ПЗ
		Если ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти.Событие) Тогда	
			СтруктураСостояния.ТабличныйДокументКонтекстноеМенюОтменитьСобытие  	= Истина;			
			СтруктураСостояния.ТабличныйДокументКонтекстноеМенюПравкаКопировать 	= Истина;	
			СтруктураСостояния.ТабличныйДокументКонтекстноеМенюПравкаВырезать   	= Истина;				
		// Для свободной области	
		Иначе	
			Если ЗначениеЗаполнено(ОтборСотрудник) Тогда				
				Если БуферОбмена.Буфер <> Неопределено Тогда
					СтруктураСостояния.ТабличныйДокументКонтекстноеМенюПравкаВставить = Истина;
				КонецЕсли;
			КонецЕсли;
			
			Сотрудник = ?(ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти.Сотрудник) И ТипЗнч(ПЗРасшифровкаТекущейОбласти.Сотрудник) = Тип("СправочникСсылка.Сотрудники")
						, ПЗРасшифровкаТекущейОбласти.Сотрудник
						, ОтборСотрудник);
						
			ВЛистеОжиданияЕстьПациенты = Ложь;
			Если ЗначениеЗаполнено(Сотрудник) Тогда
				ВЛистеОжиданияЕстьПациенты = НЕ ЭтотОбъект.СписокСотрудниковВЛистеОжидания.НайтиПоЗначению(Сотрудник) = Неопределено;
			КонецЕсли;
			
			СтруктураСостояния.ТабличныйДокументКонтекстноеМенюЗаписатьИзЛистаОжидания = ВЛистеОжиданияЕстьПациенты;
			
			СтруктураСостояния.ТабличныйДокументКонтекстноеМенюСоздатьСобытие = Истина;
		КонецЕсли;		
		// Установить доступность элементам	
		Для Каждого ЭлементС ИЗ СтруктураСостояния Цикл		
			Если НЕ Элементы[ЭлементС.Ключ].Доступность = ЭлементС.Значение Тогда
				Элементы[ЭлементС.Ключ].Доступность = ЭлементС.Значение;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛегендаЦветаНажатие(Команда)
	
	ЛегендаЭлемент = ТекущийЭлемент;
	Если Найти(ЛегендаЭлемент.Имя, "КнопкаСтатус_") = Неопределено ИЛИ Найти(ЛегендаЭлемент.Имя, "КнопкаСтатус_") = 0 Тогда
		Возврат;
	КонецЕсли;

	ДиалогЦвета = Новый ДиалогВыбораЦвета();
	#Если Не ВебКлиент Тогда
		ДиалогЦвета.Цвет = ЛегендаЭлемент .ЦветФона;
	#КонецЕсли
	
	ДиалогЦвета.Показать(Новый ОписаниеОповещения("ЛегендаЦветаНажатиеЗавершение", ЭтотОбъект, Новый Структура("ДиалогЦвета, ЛегендаЭлемент", ДиалогЦвета, ЛегендаЭлемент)));

	
КонецПроцедуры

&НаКлиенте
Процедура ЛегендаЦветаНажатиеЗавершение(Цвет, ДополнительныеПараметры) Экспорт
	
	ДиалогЦвета = ДополнительныеПараметры.ДиалогЦвета;
	ЛегендаЭлемент = ДополнительныеПараметры.ЛегендаЭлемент;
	
	Если (Цвет <> Неопределено) = Истина Тогда
		ЛегендаЭлемент.ЦветФона = Цвет;
		НаименованиеСтатуса = Элементы.Найти("НадписьСтатус_"+Сред(ЛегендаЭлемент.Имя, СтрДлина("КнопкаСтатус_")+1)).Заголовок;
		ОбщегоНазначенияСтоматология.УстановитьЦветФонаСобытия(ПолучитьСтатусСобытияПоНаименованию(НаименованиеСтатуса), ,Цвет);
		ОбновитьГрафик();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСтатусСобытияПоНаименованию(НаименованиеСтатуса)
	
	Для Каждого Статус Из Перечисления.СтатусыСобытия Цикл
		Если Строка(Статус) = НаименованиеСтатуса Тогда
			Возврат Статус;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
// Процедура - обработчик команды открытия формы планирования
//
Процедура ДобавитьВЛистОжидания(Команда)
	
	// Открыть форму создания направления
	ПараметрыФормы = Новый Структура;
	Если ПЗРасшифровкаТекущейОбласти <> Неопределено Тогда
		
		ПараметрыФормы.Вставить("ДатаНачалаПериода", ПЗРасшифровкаТекущейОбласти.Дата);
		ПараметрыФормы.Вставить("ДатаОкончанияПериода", ПЗРасшифровкаТекущейОбласти.Дата);
		
		Если ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти.Сотрудник)
			И ТипЗнч(ПЗРасшифровкаТекущейОбласти.Сотрудник) = Тип("СправочникСсылка.Сотрудники") Тогда 
			
			ПараметрыФормы.Вставить("Сотрудник", ПЗРасшифровкаТекущейОбласти.Сотрудник);
		ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.ОтборСотрудник) Тогда
			ПараметрыФормы.Вставить("Сотрудник", ЭтотОбъект.ОтборСотрудник);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыФормы.ДатаНачалаПериода) Тогда
		ПараметрыФормы.ДатаНачалаПериода = Объект.Дата;		
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ПараметрыФормы.ДатаОкончанияПериода) Тогда
		ПараметрыФормы.ДатаНачалаПериода = Объект.Дата;		
	КонецЕсли;
	
	ПараметрыФормы.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	
	ОткрытьФорму("РегистрСведений.Профосмотры.Форма.ФормаЗаписиВЛистОжидания", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды открытия формы списка планирования
//
Процедура ЗаписатьИзЛистаОжидания(Команда)

	Область = Элементы.ТабличныйДокумент.ТекущаяОбласть;
		
	Сотрудник = Неопределено;
	
	ДатаСлотаНачало = ПЗРасшифровкаТекущейОбласти.Дата + Цел(ПЗРасшифровкаТекущейОбласти.Интервал / 4) * 60 * 60 + ОбщегоНазначенияКлиентСерверСтоматология.Дроб(ПЗРасшифровкаТекущейОбласти.Интервал / 4) * 4 * 15 * 60;
	ДатаСлотаОкончание = ДатаСлотаНачало + (Область.Низ - Область.Верх + 1) / 4 * 60 * 60;
		
	Если ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти.Сотрудник)
		И ТипЗнч(ПЗРасшифровкаТекущейОбласти.Сотрудник) = Тип("СправочникСсылка.Сотрудники") Тогда 
		Сотрудник = ПЗРасшифровкаТекущейОбласти.Сотрудник;
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.ОтборСотрудник) Тогда
		Сотрудник = ЭтотОбъект.ОтборСотрудник;	
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура("ДатаСлотаНачало, ДатаСлотаОкончание", ДатаСлотаНачало, ДатаСлотаОкончание);
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ОткрытьЛистОжиданияПациентов(Сотрудник, ДатаСлотаНачало, ПараметрыОткрытия, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, открывает лист ожидания пациентов.
//
Процедура ОткрытьЛистОжиданияПациентов(Сотрудник, ДатаЛистаОжидания = Неопределено, ПараметрыОткрытия = Неопределено, СоздаватьПриемПриЗаписи = Ложь)
	
	Если НЕ ЗначениеЗаполнено(ПараметрыОткрытия) Тогда
		ПараметрыОткрытия = Новый Структура;
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("Сотрудник", Сотрудник);
	ПараметрыОткрытия.Вставить("Дата", ?(ЗначениеЗаполнено(ДатаЛистаОжидания), НачалоДня(ДатаЛистаОжидания), НачалоДня(Объект.Дата)));
    ПараметрыОткрытия.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);	
	ПараметрыОткрытия.Вставить("СоздаватьПриемПриЗаписи", СоздаватьПриемПриЗаписи);
	
	Оповещение = Неопределено;
	Если СоздаватьПриемПриЗаписи Тогда		
		Оповещение = Новый ОписаниеОповещения("ОткрытьЛистОжиданияПациентовЗавершение", ЭтотОбъект, ПараметрыОткрытия); 
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ИнтервалыЛистаОжидания.Форма.ФормаСпискаУпрощенная", ПараметрыОткрытия,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Открыть лист ожидания пациентов завершение.
//
Процедура ОткрытьЛистОжиданияПациентовЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено ИЛИ ДопПараметры = Неопределено Тогда
		Возврат;				
	КонецЕсли;
	
	СоздатьСобытие(Новый Структура("КлиентДляОткрытия", Результат));
	
КонецПроцедуры

////////////////////////// ОБРАБОТЧИКИ СОБЫТИЙ КНОПОК КОНТЕКСТНОГО МЕНЮ ///////////////////////////////////

&НаКлиенте
// Процедура - команда создания нового события
//
Процедура СоздатьСобытие(Команда)	
	
	Область = Элементы.ТабличныйДокумент.ТекущаяОбласть;	
	Если ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти) И НЕ ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти.Событие) Тогда		
		
		ЗаполняемыйКонтрагент = Неопределено;
		Если ЗначениеЗаполнено(ЭтотОбъект.ОтборКонтрагент) Тогда
			ЗаполняемыйКонтрагент = ЭтотОбъект.ОтборКонтрагент;
			
		ИначеЕсли ТипЗнч(Команда) = Тип("Структура") И Команда.Свойство("КлиентДляОткрытия")
					И ТипЗнч(Команда.КлиентДляОткрытия) = Тип("СправочникСсылка.Контрагенты") Тогда
					
			ЗаполняемыйКонтрагент = Команда.КлиентДляОткрытия;			
		КонецЕсли;
		
		ЗаполняемыйСотрудник = ?(ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти.Сотрудник), ПЗРасшифровкаТекущейОбласти.Сотрудник, ОтборСотрудник);
		Если ЗначениеЗаполнено(ЭтотОбъект.СотрудникПриКонтролеЗаписиПациента)
			И ЭтотОбъект.СотрудникПриКонтролеЗаписиПациента <> ЗаполняемыйСотрудник Тогда
			
			ЗаполняемыйКонтрагент = Неопределено;
		КонецЕсли;
		
		Старт = ПЗРасшифровкаТекущейОбласти.Дата + Цел(ПЗРасшифровкаТекущейОбласти.Интервал / 4) * 60 * 60 + ОбщегоНазначенияКлиентСерверСтоматология.Дроб(ПЗРасшифровкаТекущейОбласти.Интервал / 4) * 4 * 15 * 60;
		Финиш = Старт + (Область.Низ - Область.Верх + 1) / 4 * 60 * 60;		
		ЗначениеЗаполнения = Новый Структура();
		ЗначениеЗаполнения.Вставить("ДатаНачала"                       , Старт);
		ЗначениеЗаполнения.Вставить("ДатаОкончания"                    , Финиш);
		ЗначениеЗаполнения.Вставить("Сотрудник"                        , ЗаполняемыйСотрудник);
		ЗначениеЗаполнения.Вставить("Контрагент"                       , ЗаполняемыйКонтрагент);  
		ЗначениеЗаполнения.Вставить("ПеренесённаяПредварительнаяЗапись", ПеренесённаяПредварительнаяЗапись); 
		ЗначениеЗаполнения.Вставить("СтруктурнаяЕдиница"			   , Объект.СтруктурнаяЕдиница);
		// ЗначениеЗаполнения.Вставить("КонтактнаяИнформация", Строка(ОтборКонтрагент) + ", тел. " + ОтборКонтрагент.Телефон);
		ОткрытьФорму("Документ.Событие.ФормаОбъекта", ЗначениеЗаполнения, ЭтаФорма);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Отменить ПЗ
//
Процедура ОтменитьСобытие(Команда)
	
	Если ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти) И ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти.Событие)  Тогда		
		ОбщегоНазначенияКлиентСтоматология.ОтменитьСобытие(ПЗРасшифровкаТекущейОбласти.Событие,, Новый ОписаниеОповещения("КомандаОтменитьСобытиеЗавершение", ЭтотОбъект));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды Вырезать.
//
Процедура ПравкаВырезать(Команда)
	Если ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти) И ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти.Событие)
		И ПолучитьПризнакБлокировкиСтрокиВТЧУслуги(ПЗРасшифровкаТекущейОбласти.Событие, ПЗРасшифровкаТекущейОбласти.ИндексВТЧ) = Ложь Тогда
		БуферОбмена.ПризнакВырезать = Истина;
		БуферОбмена.Буфер = Новый Структура("Событие, ИндексВТЧ", ПЗРасшифровкаТекущейОбласти.Событие, ПЗРасшифровкаТекущейОбласти.ИндексВТЧ);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - обработчик команды Вырезать.
//
Функция ПолучитьПризнакБлокировкиСтрокиВТЧУслуги(Событие, ИндексВТЧ)
	
	Если ТипЗнч(ИндексВТЧ) = Тип("Число") Тогда
		ПризнакЗаблокированно = Событие.Услуги[ИндексВТЧ].ПризнакЗаблокированно;
	ИначеЕсли ТипЗнч(ИндексВТЧ) = Тип("Массив") И ИндексВТЧ.Количество() > 0 Тогда
		ПризнакЗаблокированно = Событие.Услуги[ИндексВТЧ[0]].ПризнакЗаблокированно;
	КонецЕсли;
	
	Возврат ПризнакЗаблокированно;	
	
КонецФункции

&НаКлиенте
// Процедура - обработчик команды Копировать.
//
Процедура ПравкаКопировать(Команда)	
	Если ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти) И ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти.Событие) Тогда
		БуферОбмена.ПризнакВырезать = Ложь;
		БуферОбмена.Буфер = Новый Структура("Событие, ИндексВТЧ", ПЗРасшифровкаТекущейОбласти.Событие, ПЗРасшифровкаТекущейОбласти.ИндексВТЧ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды Вставить.
//
Процедура ПравкаВставить(Команда)	
	Если БуферОбмена.Буфер <> Неопределено И ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти) И НЕ ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти.Событие) Тогда
		СоздатьСобытиеКопированием(БуферОбмена.Буфер, БуферОбмена.ПризнакВырезать);
		Оповестить("ИзмененоСобытие");
		Если БуферОбмена.ПризнакВырезать = Истина Тогда
			БуферОбмена.ПризнакВырезать  = Ложь;
			БуферОбмена.Буфер = Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
// Процедура создание групповой записи копированием из существующей.
//
Процедура СоздатьСобытиеКопированием(СтруктураСобытия, Перенести = Ложь)
	
	ОбластьКалендаря = Элементы.ТабличныйДокумент.ТекущаяОбласть;
	Если ТипЗнч(СтруктураСобытия.ИндексВТЧ) <> Тип("Массив") Тогда
		НовыйМассив = Новый Массив;
		НовыйМассив.Добавить(СтруктураСобытия.ИндексВТЧ);
		СтруктураСобытия.ИндексВТЧ = НовыйМассив; 
	КонецЕсли;	
	// Высчитываем реквизиты события по переданной области
	Старт = ПЗРасшифровкаТекущейОбласти.Дата + Цел(ПЗРасшифровкаТекущейОбласти.Интервал / 4) * 60 * 60 + ОбщегоНазначенияКлиентСерверСтоматология.Дроб(ПЗРасшифровкаТекущейОбласти.Интервал / 4) * 4 * 15 * 60;
	СтартДельта = СтруктураСобытия.Событие.Услуги[СтруктураСобытия.ИндексВТЧ[0]].ДатаНачала;		
	Если Перенести Тогда
		СобытиеОбъект = СтруктураСобытия.Событие.ПолучитьОбъект();
		Для Каждого ИндексСтрокиСобытия Из СтруктураСобытия.ИндексВТЧ Цикл
			СтрокаСобытия               = СобытиеОбъект.Услуги[ИндексСтрокиСобытия];
			СтрокаСобытия.ДатаНачала    = Старт + (СтрокаСобытия.ДатаНачала - СтартДельта);
			СтрокаСобытия.ДатаОкончания = Старт + (СтрокаСобытия.ДатаОкончания - СтартДельта);			
			СтрокаСобытия.Сотрудник     = ?(Не ОтборСотрудник.Пустая(), ОтборСотрудник, СтрокаСобытия.Сотрудник);
			СтрокаСобытия.Помещение     = СтрокаСобытия.Помещение;
		КонецЦикла;
	Иначе
		СобытиеОбъект      = СтруктураСобытия.Событие.ПолучитьОбъект().Скопировать();
		СобытиеОбъект.Дата = ТекущаяДата();
		СобытиеОбъект.Услуги.Очистить();
		Для Каждого ИндексСтрокиСобытия Из СтруктураСобытия.ИндексВТЧ Цикл
			СтрокаСобытия = СтруктураСобытия.Событие.Услуги[ИндексСтрокиСобытия];
			НоваяСтрока   = СобытиеОбъект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСобытия);
			НоваяСтрока.ДатаНачала    = Старт + (НоваяСтрока.ДатаНачала - СтартДельта);
			НоваяСтрока.ДатаОкончания = Старт + (НоваяСтрока.ДатаОкончания - СтартДельта);
			НоваяСтрока.Сотрудник     = ?(Не ОтборСотрудник.Пустая(), ОтборСотрудник, НоваяСтрока.Сотрудник);
			НоваяСтрока.Помещение     = НоваяСтрока.Помещение;
		КонецЦикла;		
	КонецЕсли;	
	
	// Запускаем ОбработкаПроверкиЗаполнения.
	ЗаписьРазрешена = СобытиеОбъект.ПроверитьЗаполнение();	
	
	Если ЗаписьРазрешена = Истина Тогда		 
		
		Попытка
			СобытиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			ВызватьИсключение;	
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Обновить график ПЗ 
//
Процедура Обновить(Команда)
	ОбновитьГрафик();	
КонецПроцедуры

&НаКлиенте
// Обработчик журнала ПЗ, расширения интервала раб.времени сотрудника  
//
Процедура ГрафикПЗВремяРаботыСотрудникаРасширить(Команда)		
	Область     = Элементы.ТабличныйДокумент.ТекущаяОбласть;
	Если ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти) И НЕ ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти.Событие) Тогда	
		Старт     = ПЗРасшифровкаТекущейОбласти.Дата + Цел(ПЗРасшифровкаТекущейОбласти.Интервал / (60/ИнтервалГрафикаЗанятий)) * 60 * 60 + ОбщегоНазначенияКлиентСерверСтоматология.Дроб(ПЗРасшифровкаТекущейОбласти.Интервал / (60/ИнтервалГрафикаЗанятий)) * (60/ИнтервалГрафикаЗанятий) * ИнтервалГрафикаЗанятий * 60;
		Финиш     = Старт + (Область.Низ - Область.Верх + 1) / (60/ИнтервалГрафикаЗанятий) * 60 * 60;	
		Если НЕ ОтборСотрудник.Пустая() Тогда		
			УстановитьРабочееВремя(Старт,Финиш,ОтборСотрудник,Истина);
			// ОбновитьСтраницуЖурналаПЗ(,Истина);
			ОбновитьГрафик();		
		КонецЕсли;		
	КонецЕсли;		 
КонецПроцедуры

&НаКлиенте
// Обработчик журнала ПЗ, уменьшения интервала раб.времени сотрудника
//
Процедура ГрафикПЗВремяРаботыСотрудникаУменьшить(Команда)	
	Область     = Элементы.ТабличныйДокумент.ТекущаяОбласть;
	Если ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти) И НЕ ЗначениеЗаполнено(ПЗРасшифровкаТекущейОбласти.Событие) Тогда		
		Старт     = ПЗРасшифровкаТекущейОбласти.Дата + Цел(ПЗРасшифровкаТекущейОбласти.Интервал / (60/ИнтервалГрафикаЗанятий)) * 60 * 60 + ОбщегоНазначенияКлиентСерверСтоматология.Дроб(ПЗРасшифровкаТекущейОбласти.Интервал / (60/ИнтервалГрафикаЗанятий)) * (60/ИнтервалГрафикаЗанятий) * ИнтервалГрафикаЗанятий * 60;
		Финиш     = Старт + (Область.Низ - Область.Верх + 1) / (60/ИнтервалГрафикаЗанятий) * 60 * 60;
		Если НЕ ОтборСотрудник.Пустая() Тогда			
			ВозвратСообщения = "";
			// Проверка возможности удаления рабочего времени
			Если НЕ ПроверитьВозможностьУдаленияРабочегоВремениСотрудника(Старт,Финиш,ОтборСотрудник,Объект.СтруктурнаяЕдиница,ВозвратСообщения) Тогда
				ПоказатьВопрос(Новый ОписаниеОповещения("ГрафикПЗВремяРаботыСотрудникаЗавершение", ЭтотОбъект, Новый Структура("Старт, Финиш", Старт, Финиш)), ВозвратСообщения+" Продолжить?",РежимДиалогаВопрос.ДаНет);
                Возврат;		
			КонецЕсли;		
			УстановитьРабочееВремя(Старт,Финиш,ОтборСотрудник,Ложь);
			ОбновитьГрафик(); 
			
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
// Процедура - График ПЗВремя работы сотрудника завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ГрафикПЗВремяРаботыСотрудникаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Старт = ДополнительныеПараметры.Старт;
	Финиш = ДополнительныеПараметры.Финиш;
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;		
	
	УстановитьРабочееВремя(Старт,Финиш,ОтборСотрудник,Ложь);
	ОбновитьГрафик(); 
	
КонецПроцедуры


&НаСервереБезКонтекста
// Процедура устанавливает рабочее время сотрудника  
//
Процедура УстановитьРабочееВремя(НачалоПериода,КонецПериода,Сотрудник,РасширениеИнтервала)
	РегистрыСведений.ВремяРаботыСотрудниковПлан.УстановкаРабочегоВремениСотрудника(ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница, Сотрудник, РасширениеИнтервала, НачалоПериода, КонецПериода);	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция вернет признак возможности удаления рабочего времени сотрудника 
//
Функция ПроверитьВозможностьУдаленияРабочегоВремениСотрудника(НачалоПериода,КонецПериода,Сотрудник,СтруктурнаяЕдиница,ВозвратСообщения = "")	
	Возврат РегистрыСведений.ВремяРаботыСотрудниковПлан.ПроверитьВозможностьУдаленияРабочегоВремени(НачалоПериода,КонецПериода,Сотрудник,СтруктурнаяЕдиница,ВозвратСообщения);	
КонецФункции

&НаКлиенте
Процедура ПечатьПредварительнойЗаписи(Команда)
	
	// СтруктураПараметры = Новый Структура;	
	// Если Элементы.День.Пометка Тогда
	//     СтруктураПараметры.Вставить("Режим", "День");
	// Иначе
	//     СтруктураПараметры.Вставить("Режим", "Неделя");
	// КонецЕсли;	
	// СтруктураПараметры.Вставить("Дата"     , Объект.Дата);
	// СтруктураПараметры.Вставить("Сотрудник", ОтборСотрудник);
	// ОткрытьФорму("Отчет.ПредварительнаяЗаписьДляПечати.Форма", СтруктураПараметры, ЭтаФорма, УникальныйИдентификатор);

	ПараметрыПостроения = Новый Структура("ВыбранныеСотрудники, ВыбранныеПомещения, СтраницаМенеджера, РазрешениеЭкрана, СтруктурнаяЕдиница, Дата, РазрешитьСмещениеГрафика, УчитыватьГрафикРаботыСотрудников, НаВсюФорму");
	
	Если Элементы.День.Пометка Тогда
	     ПараметрыПостроения.Вставить("Режим", "День");
	Иначе
	     ПараметрыПостроения.Вставить("Режим", "Неделя");
	КонецЕсли;	

	ПараметрыПостроения.СтраницаМенеджера					=	ПолучитьСтраницуМенеджера();
	ПараметрыПостроения.СтруктурнаяЕдиница					=	Объект.СтруктурнаяЕдиница;
	ПараметрыПостроения.Дата								=	Объект.Дата;
	ПараметрыПостроения.РазрешитьСмещениеГрафика			=   Истина;
	ПараметрыПостроения.РазрешениеЭкрана					=   РазрешениеЭкрана;
	ПараметрыПостроения.УчитыватьГрафикРаботыСотрудников 	= 	Ложь;
	ПараметрыПостроения.НаВсюФорму			             	= 	Истина;
	ВыбранныеСотрудники = Новый Массив;  
	Если ЗначениеЗаполнено(СпециализацияВрача) Тогда 
		МассивСотрудников = ПолучитьМассивВрачейПоСпециализации(СпециализацияВрача);
		Если ЗначениеЗаполнено(МассивСотрудников) Тогда
			Для Каждого	Сотрудник Из МассивСотрудников Цикл
				ВыбранныеСотрудники.Добавить(Сотрудник);
			КонецЦикла;
		Иначе 
			ВыбранныеСотрудники.Добавить("Все")
		КонецЕсли;
	Иначе
		ВыбранныеСотрудники.Добавить(?(Не ОтборСотрудник.Пустая(), ОтборСотрудник, "Все"));
	КонецЕсли;
	ВыбранныеПомещения = Новый Массив; 
	ВыбранныеПомещения.Добавить("Все");
	ПараметрыПостроения.ВыбранныеСотрудники 				=	ВыбранныеСотрудники;
	ПараметрыПостроения.ВыбранныеПомещения 					=	ВыбранныеПомещения;
	ПараметрыПостроения.Вставить("ВыводитьКартинки", Ложь);
	ПараметрыПостроения.Вставить("ИнтервалГрафикаЗанятий", ИнтервалГрафикаЗанятий);
	ПараметрыПостроения.Вставить("Сотрудник", ОтборСотрудник);
	ПараметрыПостроения.Вставить("МассивСотрудниковИОбластей", Неопределено);
	ОткрытьФорму("Отчет.ПредварительнаяЗаписьДляПечати.Форма", ПараметрыПостроения, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

///////////////////////////////////// ДОПОЛНИТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ//////////////////////////////////////////////

&НаКлиенте
// Процедура - Команда отменить событие завершение.
//
Процедура КомандаОтменитьСобытиеЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Истина Тогда
		ОбновитьГрафик(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить цвет группы кнопки
//
Процедура УстановитьЦветГруппыКнопки()
	
	Если Элементы.День.Пометка Тогда 
		
		ГруппаКоманднойПанели          = Элементы.ГруппаКоманднаяПанельДни;
		
		Элементы.День.ЦветТекста       = ЭтотОбъект.ЦветаЭлементов.ЦветТекстаВыбранного;
		Элементы.ГруппаДень.ЦветФона   = ЭтотОбъект.ЦветаЭлементов.ЦветФонаВыбранного;
		Элементы.Неделя.ЦветТекста     = ЭтотОбъект.ЦветаЭлементов.ЦветТекста;
		Элементы.ГруппаНеделя.ЦветФона = ЭтотОбъект.ЦветаЭлементов.ЦветФона;  
		
	Иначе
		
		ГруппаКоманднойПанели          = Элементы.ГруппаКоманднаяПанельНедели;
		
		Элементы.День.ЦветТекста       = ЭтотОбъект.ЦветаЭлементов.ЦветТекста;
		Элементы.ГруппаДень.ЦветФона   = ЭтотОбъект.ЦветаЭлементов.ЦветФона;
		Элементы.Неделя.ЦветТекста     = ЭтотОбъект.ЦветаЭлементов.ЦветТекстаВыбранного;
		Элементы.ГруппаНеделя.ЦветФона = ЭтотОбъект.ЦветаЭлементов.ЦветФонаВыбранного;
		
	КонецЕсли;
	
	Для Каждого Группа Из ГруппаКоманднойПанели.ПодчиненныеЭлементы Цикл
		
		Если Группа.ПодчиненныеЭлементы[0].Пометка Тогда 
			Группа.ЦветФона                          = ЭтотОбъект.ЦветаЭлементов.ЦветФонаВыбранного; 
			Группа.ПодчиненныеЭлементы[0].ЦветТекста = ЭтотОбъект.ЦветаЭлементов.ЦветТекстаВыбранного;
		Иначе
			Группа.ЦветФона                          = ЭтотОбъект.ЦветаЭлементов.ЦветФона; 			
			Группа.ПодчиненныеЭлементы[0].ЦветТекста = ЭтотОбъект.ЦветаЭлементов.ЦветТекста;
		КонецЕсли;  		
		
	КонецЦикла;	
		
КонецПроцедуры

&НаСервере
// Процедура - Получить разрешение монитора клиента.
// 
Процедура ПолучитьРазрешениеМонитораКлиента()
		
	ЭкраныКлиента = ПолучитьИнформациюЭкрановКлиента();
	ЭтотОбъект.ИнформацияЭкранаКлиента = ?(ЭкраныКлиента <> Неопределено, ЭкраныКлиента[0], Неопределено);
	
	Если ЭтотОбъект.ИнформацияЭкранаКлиента <> Неопределено Тогда
		
		ШиринаЭкрана = ЭтотОбъект.ИнформацияЭкранаКлиента.Ширина;
		
		Если ШиринаЭкрана < 1920 Тогда
			
			МасштабФормы = (ШиринаЭкрана / 1920) * 1.2 * 100;
			ЭтаФорма.Масштаб = ?(МасштабФормы >= 80, МасштабФормы, 80);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте 
// Процедура, Обработчик события "ОтборСотрудникНачалоВыбора"
//
Процедура ОтборСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;  
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Очистить();
	ДанныеВыбора.ЗагрузитьЗначения(ПолучитьМассивВрачейПоСпециализации(СпециализацияВрача));
	Если ЗначениеЗаполнено(СпециализацияВрача) Тогда
		ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВыбора", Новый Структура("Специализация", СпециализацияВрача), Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;
	
КонецПроцедуры     

&НаСервереБезКонтекста
// Функция - Получить массив врачей по специализации
//
// Параметры:
//  Специализация	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивВрачейПоСпециализации(Специализация)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиСпецилазацииСотрудника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники.СпецилазацииСотрудника КАК СотрудникиСпецилазацииСотрудника
	|ГДЕ
	|	СотрудникиСпецилазацииСотрудника.Специализация = &Специализация
	|	И НЕ СотрудникиСпецилазацииСотрудника.Ссылка.ПометкаУдаления
	|	И НЕ СотрудникиСпецилазацииСотрудника.Ссылка.ЭтоГруппа");
	
	Запрос.УстановитьПараметр("Специализация", Специализация);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции


#КонецОбласти
